# Basic DataFrame Operations in Pandas 

Mostly reviews as I did not practice for a while...

## 2877. Create a DataFrame from List

Write a solution to create a DataFrame from a 2D list called student_data. This 2D list contains the IDs and ages of some students.

The DataFrame should have two columns, student_id and age, and be in the same order as the original 2D list.

In [34]:
# Import
import pandas as pd
import numpy as np
import matplotlib.pyplot as pb
import seaborn as sns

In [35]:
# Creating student data list
student_data = [[1,15],[2,11],[3,11],[4,20]]

# Another Dataset
# mobile_device_df = pd.read_csv(

In [36]:
# Creating DataFrame 
student_df = pd.DataFrame(student_data, columns=["student_id","age"])

In [37]:
# Print 
print(student_df)

   student_id  age
0           1   15
1           2   11
2           3   11
3           4   20

## 2878. Get the Size of a DataFrame

Write a solution to calculate and display the number of rows and columns of players.

Return the result as an array:

In [38]:
[rows,cols] = student_df.shape 

print([rows,cols])

[4, 2]

In [39]:
# Shape of Data 
# mobile_device_df.shape

# 2879. Display the First Three Rows

a solution to display the first 3 rows of this DataFrame.

In [40]:
# Getting the top 3 rows
# mobile_device_df.head(3)

# Head by default give top 5 rows
# mobile_device_df.head()

# 2880. Select Data

Write a solution to select the uid of iOS users

In [41]:
# Getting specific values based on loc for my case I am looking for iOS user IDs
# mobile_device_df.loc[mobile_device_df['Operating System'] == 'iOS',['User ID']]

# To take it to a next level I will count the values
# ios_uid = mobile_device_df.loc[mobile_device_df['Operating System'] == 'iOS',['User ID']].count()

# print(ios_uid)

# 2881. Create a New Column

A company plans to provide its employees with a bonus.

Write a solution to create a new column name bonus that contains the doubled values of the salary column.

In [42]:
# Create the data and DF

data = {
    'name': ['Piper', 'Grace', 'Georgia', 'Willow', 'Finn', 'Thomas'],
    'salary': [4548, 28150, 1103, 6593, 74576, 24433]
}
employees = pd.DataFrame(data)

print(employees)

      name  salary
0    Piper    4548
1    Grace   28150
2  Georgia    1103
3   Willow    6593
4     Finn   74576
5   Thomas   24433

In [43]:
# Shape of the data returns a tuple
employees.shape

(6, 2)

In [44]:
# first 3 rows

employees.head(3)

      name  salary
0    Piper    4548
1    Grace   28150
2  Georgia    1103

In [45]:
# unconventional approach using list, for loop 
bonus = []

for i in range(len(employees)):
    bonus.append(employees['salary'][i] * 2)

In [46]:
# Create a column 

employees['bonus'] = bonus

In [47]:
print(employees)

      name  salary   bonus
0    Piper    4548    9096
1    Grace   28150   56300
2  Georgia    1103    2206
3   Willow    6593   13186
4     Finn   74576  149152
5   Thomas   24433   48866